# PW Skills Pandas Basic Assignment

## Question1:
Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [1]:
import pandas as pd
lst= [4,8,15,16,23,42]
df=pd.DataFrame(lst)
df

    0
0   4
1   8
2  15
3  16
4  23
5  42

## Question 2:
Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [3]:
import pandas as pd
lst1= [1,2,3,4,5,6,7,8,9,10]
df1=pd.DataFrame(lst1)
df1

    0
0   1
1   2
2   3
3   4
4   5
5   6
6   7
7   8
8   9
9  10

## Question 3

In [12]:
lst1= [["Alice","25", "Female"],["Bob","30","Male"],["Claire", "27", "Female"]]
lst3= ["Name","Age","Gender"]
q3=pd.DataFrame(lst1, columns=lst3)
q3

# When we are using List of lists, Each list inside a list will constitute a row of a Data Frame

     Name Age  Gender
0   Alice  25  Female
1     Bob  30    Male
2  Claire  27  Female

## Question 4:
What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

## Answer:
Pandas DataFrame is two-dimensional size-mutable, potentially heterogeneous tabular data structure with labeled axes (rows and columns).

Both DataFrame and series are the two main data structure of pandas library. Series in pandas contains a single list which can store heterogeneous type of data, because of this, series is also considered as a 1-dimensional data structure.

On the other hand, DataFrame is a 2-dimensional data structure which contains multiple lists of heterogeneous type of data. DataFrame can contain multiple series or it can be considered as a collection of series

In the Table created above whole q3 table is the data frame and each columns of Data Frame (example: Name/Age/ Gender) are series

## Question 5:
What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

## Answer:
There are many functions in pandas that can be used to manipulate data in a DataFrame. Some of the common functions are:

head(): Returns the first n rows of the DataFrame. By default, n=5.
tail(): Returns the last n rows of the DataFrame. By default, n=5.
describe(): Generates descriptive statistics that summarize the central tendency, dispersion and shape of a dataset’s distribution.
drop(): Remove rows or columns by specifying label names and corresponding axis.
sort_values(): Sorts a DataFrame in ascending or descending order based on one or more columns.

For example, we might use the head() function to quickly view the first few rows of a large DataFrame to get an idea of what the data looks like. Or we might use the sort_values() function to sort a DataFrame by a specific column so that you can easily see which rows have the highest or lowest values for that column

## Question 6:
Which of the following is mutable in nature: Series, DataFrame, Panel?

## Answer:
Series, Data Frame, Panel: all are commutable in nature

## Question7:
Create a DataFrame using multiple Series. Explain with an example.

## Answer:

In the example below, q7 Data Frame has 3 Series with names "Item", "Amount", "Cost Per Kg or Litre"

In [14]:
lst1= [["Milk","25 Litre", "50 Rupees"],["Tea Leaves","300 Gms","1500 Rupees"],["Rice", "27 Kg", "50 Rupees"]]
lst3= ["Item","Amount","Cost per Kg or Litre"]
q7=pd.DataFrame(lst1, columns=lst3)
q7

         Item    Amount Cost per Kg or Litre
0        Milk  25 Litre            50 Rupees
1  Tea Leaves   300 Gms          1500 Rupees
2        Rice     27 Kg            50 Rupees